export const routes = [
  {
    id: "141",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
      "2) Пройдите налево по коридору к леснице и спуститесь на 1-й этаж",
      "3) Пройдите налево по коридору до комнаты 141",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 1.75, z: -6.587 },
      { x: 0.161, y: 1.75, z: -6.621 },
      { x: -0.338, y: 1.75, z: -2.192 },
      { x: -0.201, y: 1.75, z: -2.232 },
      { x: -0.377, y: 1.75, z: -0.993 },
      { x: 0.445, y: 1.75, z: 0.473 },
      { x: 4.502, y: 1.75, z: 0.473 },
      { x: 4.502, y: 1.75, z: -0.036 },
      { x: 4.502, y: -0.35, z: -0.036 },
      { x: 4.502, y: -0.35, z: 0.473 },
      { x: 5.729, y: -0.35, z: 0.473 },
      { x: 5.729, y: -0.35, z: 0.173 },
      { x: 5.729, y: -0.45, z: 0.173 },
    ],
    room: {
      geom: "box",
      x: 5.729, y: -0.45, z: 0.16, a: 0,
      w: 0.6, h: 0.3
    },
  },
  {
    id: "262",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 2-й этаж",
      "2) Пройдите направо по коридору до комнаты 262",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 0.65, z: -6.587 },
      { x: 0.161, y: 0.65, z: -6.621 },
      { x: 0.223, y: 0.65, z: -7.444 },
      { x: 0.798, y: 0.65, z: -7.855 },
      { x: 0.817, y: 0.65, z: -8.091 },
      { x: 0.817, y: 0.55, z: -8.091 },
    ],
    room: {
      geom: "box",
      x: 0.827, y: 0.55, z: -8.101, a: 0.3,
      w: 0.6, h: 0.3
    },
  },
  {
    id: "285",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 2-й этаж",
      "2) Пройдите налево по коридору до комнаты 285",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 0.65, z: -6.587 },
      { x: 0.161, y: 0.65, z: -6.621 },
      { x: -0.064, y: 0.65, z: -4.661 },
      { x: 1.111, y: 0.65, z: -4.524 },
      { x: 1.111, y: 0.55, z: -4.524 },
    ],
    room: {
      geom: "box",
      x: 1.105, y: 0.55, z: -4.495, a: 0.1,
      w: 0.9, h: 0.96
    },
  },
  {
    id: "380",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
      "2) Пройдите налево по коридору до комнаты 380",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 1.725, z: -6.587 },
      { x: 0.161, y: 1.725, z: -6.621 },
      { x: -0.221, y: 1.725, z: -2.821 },
      { x: 0.089, y: 1.725, z: -2.819 },
      { x: 0.089, y: 1.6, z: -2.819 },
    ],
    room: {
      geom: "box",
      x: 0.089, y: 1.6, z: -2.819, a: 0.1,
      w: 0.6, h: 0.4
    },
  },
  {
    id: "471",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 4-й этаж",
      "2) Пройдите налево по коридору до комнаты 471",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 2.375, z: -6.587 },
      { x: 0.161, y: 2.375, z: -6.621 },
      { x: -0.191, y: 2.375, z: -3.371 },
      { x: -0.571, y: 2.375, z: -3.427 },
      { x: -0.571, y: 2.275, z: -3.427 },
    ],
    room: {
      geom: "box",
      x: -0.625, y: 2.275, z: -3.427, a: 0.1,
      w: 0.5, h: 1.1
    },
  },
  {
    id: "Библиотека",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
      "2) Пройдите от лестницы направо",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 1.725, z: -6.587 },
      { x: 0.161, y: 1.725, z: -6.621 },
      { x: 0.167, y: 1.725, z: -7.044 },
      { x: 0.167, y: 1.65, z: -7.044 },
    ],
    room: {
      geom: "shape",
      x: 0.169, y: 1.65, z: -8.639, a: 0.19,
      points: [
        { x: -0.446, y: 0.148 },
        { x: -0.276, y: 1.939 },
        { x: 1.73, y: 1.369 },
        { x: 1.65, y: 0.904 },
        { x: 2.253, y: 0.804 },
        { x: 2.209, y: 0.385 },
      ]
    },
  },
  {
    id: "Актовый зал",
    guides: [
      "1) Пройдите через холл к леснице и поднимитесь на 4-й этаж",
      "2) Пройдите от лестницы направо",
    ],
    points: [
      { x: 1.068, y: -0.35, z: -9.536 },
      { x: 0.887, y: -0.35, z: -8.243 },
      { x: 0.186, y: -0.35, z: -6.871 },
      { x: 0.161, y: -0.35, z: -6.621 },
      { x: 0.592, y: -0.35, z: -6.587 },
      { x: 0.592, y: 2.375, z: -6.587 },
      { x: 0.161, y: 2.375, z: -6.621 },
      { x: 0.269, y: 2.375, z: -7.581 },
      { x: 0.269, y: 2.275, z: -7.581 },
    ],
    room: {
      geom: "shape",
      x: 0.169, y: 2.275, z: -8.639, a: 0.19,
      points: [
        { x: -0.016, y: 0.168 },
        { x: 0.106, y: 1.439 },
        { x: 2.253, y: 0.804 },
        { x: 2.209, y: 0.385 },
      ]
    },
  },
];

export const groups = [
  {
    id: "P4170",
    schedule: [
      {
        time: "11:40",
        room: "141",
        course: "КМИ",
        teacher: "Балканский"
      },
      {
        time: "15:00",
        room: "285",
        course: "ППИ",
        teacher: "Саркисова"
      }
    ]
  },
  {
    id: "P4171",
    schedule: [
      {
        time: "11:40",
        room: "285",
        course: "ППИ",
        teacher: "Саркисова"
      },
      {
        time: "15:00",
        room: "141",
        course: "Психология",
        teacher: "Локалов"
      }
    ]
  },
];

export const teachers = [
  {
    name: "Балканский",
    schedule: [
      {
        time: "11:40",
        room: "141",
        course: "КМИ",
        group: "P4170"
      },
    ]
  },
  {
    name: "Локалов",
    schedule: [
      {
        time: "15:00",
        room: "141",
        course: "Психология",
        group: "P4171"
      },
    ]
  },
  {
    name: "Саркисова",
    schedule: [
      {
        time: "11:40",
        room: "285",
        course: "ППИ",
        group: "P4171"
      },
      {
        time: "15:00",
        room: "285",
        course: "ППИ",
        group: "P4170"
      },
    ]
  },
];

export const places = [
  {
    name: "ФПИиКТ",
    room: "380"
  },
  {
    name: "ФСУиР",
    room: "471"
  },
];