export const routes = [
  {
    id: "141",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "3",
        guide: "2) Пройдите налево по коридору к леснице и спуститесь на 1-й этаж",
        points: [
          { x: 1127, y: 300 },
          { x: 1132, y: 251 },
          { x: 445, y: 173 },
          { x: 440, y: 193 },
          { x: 330, y: 182 },
          { x: 252, y: 191 },
          { x: 156, y: 278 },
          { x: 152, y: 685 },
          { x: 175, y: 715 },
          { x: 208, y: 715 },
        ],
      },
      {
        part: 3,
        floor: "1",
        guide: "3) Пройдите налево по коридору до комнаты 141",
        points: [
          { x: 178, y: 656 },
          { x: 122, y: 658 },
          { x: 116, y: 830 },
        ],
      },
    ],
  },
  {
    id: "262",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 2-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "2",
        guide: "2) Пройдите направо по коридору до комнаты 262",
        points: [
          { x: 1142, y: 254 },
          { x: 1147, y: 208 },
          { x: 1258, y: 216 },
          { x: 1340, y: 321 },
        ],
      },
    ],
  },
  {
    id: "285",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 2-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "2",
        guide: "2) Пройдите налево по коридору до комнаты 285",
        points: [
          { x: 1142, y: 254 },
          { x: 1147, y: 208 },
          { x: 859, y: 176 },
          { x: 850, y: 241 },
        ],
      },
    ],
  },
  {
    id: "380",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "3",
        guide: "2) Пройдите налево по коридору до комнаты 380",
        points: [
          { x: 1127, y: 298 },
          { x: 1136, y: 251 },
          { x: 521, y: 179 },
        ],
      },
    ],
  },
  {
    id: "471",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 4-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "4",
        guide: "2) Пройдите налево по коридору до комнаты 471",
        points: [
          { x: 1109, y: 255 },
          { x: 1114, y: 206 },
          { x: 662, y: 150 },
        ],
      },
    ],
  },
  {
    id: "Библиотека",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 3-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "3",
        guide: "2) Пройдите от лестницы направо",
        points: [
          { x: 1127, y: 298 },
          { x: 1135, y: 255 },
          { x: 1201, y: 262 },
        ],
      },
    ],
  },
  {
    id: "Актовый зал",
    floors: [
      {
        part: 1,
        floor: "1",
        guide: "1) Пройдите через холл к леснице и поднимитесь на 4-й этаж",
        points: [
          { x: 1359, y: 322 },
          { x: 1304, y: 314 },
          { x: 1214, y: 195 },
          { x: 1119, y: 187 },
          { x: 1113, y: 234 },
        ],
      },
      {
        part: 2,
        floor: "4",
        guide: "2) Пройдите от лестницы направо",
        points: [
          { x: 1109, y: 257 },
          { x: 1116, y: 216 },
          { x: 1224, y: 228 },
        ],
      },
    ],
  },
];

export const groups = [
  {
    id : "P4170",
    schedule : [
      {
        time: "11:40",
        room: "141",
        course: "КМИ",
        teacher: "Балканский"
      },
      {
        time: "15:00",
        room: "285",
        course: "ППИ",
        teacher: "Саркисова"
      }
    ]
  },
  {
    id : "P4171",
    schedule : [
      {
        time: "11:40",
        room: "285",
        course: "ППИ",
        teacher: "Саркисова"
      },
      {
        time: "15:00",
        room: "141",
        course: "Психология",
        teacher: "Локалов"
      }
    ]
  },
];

export const teachers = [
  {
    name: "Балканский",
    schedule: [
      {
        time: "11:40",
        room: "141",
        course: "КМИ",
        group: "P4170"
      },
    ]
  },
  {
    name: "Локалов",
    schedule: [
      {
        time: "15:00",
        room: "141",
        course: "Психология",
        group: "P4171"
      },
    ]
  },
  {
    name: "Саркисова",
    schedule: [
      {
        time: "11:40",
        room: "285",
        course: "ППИ",
        group: "P4171"
      },
      {
        time: "15:00",
        room: "285",
        course: "ППИ",
        group: "P4170"
      },
    ]
  },
];

export const places = [
  {
    name: "ФПИиКТ",
    room: "380"
  },
  {
    name: "ФСУиР",
    room: "471"
  },
];